Documents/ДополнительноеСоглашение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Document>
		<Properties>
			<Name>ДополнительноеСоглашение</Name>
			<BasedOn>
				<xr:Item>Document.Договор</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Управленческий</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Договор</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеИзменений</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Офис</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Офисы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccountingRegisters/Управленческий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<AccountingRegister>
		<Properties>
			<Name>Управленческий</Name>
			<ChartOfAccounts>ChartOfAccounts.Управленческий</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Управленческий.AccountingFlag.Количественный</AccountingFlag>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

Documents/ДополнительноеСоглашение/Ext/ManagerModule.bsl
Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка) Экспорт
 
 ЛексСервер.ПолучитьПредставлениеДокумента(Данные, Представление, СтандартнаяОбработка);
 
КонецПроцедуры

Процедура ПечатьДопСоглашение(ТабДок, Ссылка) Экспорт
	
	// будем печатать только первый документ
	// нет времени сейчас заморачиваться с 
	// групповой печатью
	
	ДокументСсылка = Ссылка[0];
	
	Макет = Документы.ДополнительноеСоглашение.ПолучитьМакет("Соглашение");
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДополнительноеСоглашение.Дата ДатаДокумента,
	|	ДополнительноеСоглашение.Офис,
	|	ДополнительноеСоглашение.СуммаДокумента,
	|	ДополнительноеСоглашение.Договор.Номер НомерДоговора,
	|	ДополнительноеСоглашение.Договор.Дата ДатаДоговора,
	|	ДополнительноеСоглашение.Договор.Контрагент Контрагент,
	|	ДополнительноеСоглашение.Договор.Организация Организация
	|ИЗ
	|	Документ.ДополнительноеСоглашение КАК ДополнительноеСоглашение";
	
	Запрос.Параметры.Вставить("Ссылка", ДокументСсылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	ОбластьТело = Макет.ПолучитьОбласть("Тело");
	ТабДок.Очистить();
	
	ВставлятьРазделительСтраниц = Ложь;
	Если НЕ Выборка.Следующий() Тогда
		Возврат;
	КонецЕсли;
	
//	ОбластьТело.Параметры.Заполнить(ЛексСервер.ПолучитьРеквизитыКлиента(Выборка.Контрагент));
	ОбластьТело.Параметры.Заполнить(ЛексСервер.ПолучитьРеквизитыОрганизации(Выборка.Организация));
	ОбластьТело.Параметры.Заполнить(Выборка);
	
	Если Выборка.Контрагент.ЮридическоеЛицо Тогда
		НаименованиеПокупателя = Выборка.Контрагент.ПолноеНаименование;
	Иначе
		НаименованиеПокупателя = Выборка.Контрагент.Наименование;
	КонецЕсли;
	
	ОбластьТело.Параметры.НаименованиеПокупателя = НаименованиеПокупателя;
	ОбластьТело.Параметры.ДатаДоговора = Формат(Выборка.ДатаДоговора, "ДЛФ=DD");
	ОбластьТело.Параметры.ДатаДокумента = Формат(Выборка.ДатаДокумента, "ДЛФ=DD");
	
	ТабДок.Вывести(ОбластьТело);
	
	
КонецПроцедуры

Функция ПолучитьСуммуПлатежа(ДопСоглашениеСсылка) Экспорт
	
	// { Васильев Александр Леонидович [06.09.2013]
	// Лёха, вынеси в общий модуль. И в договоре тоже используй эту функцию
	// } Васильев Александр Леонидович [06.09.2013]
	
	Ответ = 0;
	
	СвойстваДоговора = ОбщегоНазначения.ПолучитьЗначенияРеквизитов(ДопСоглашениеСсылка.Договор, "Контрагент, Подразделение");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ДопСоглашение", ДопСоглашениеСсылка);
	Запрос.УстановитьПараметр("Контрагент", СвойстваДоговора.Контрагент);
	Запрос.УстановитьПараметр("Подразделение", СвойстваДоговора.Подразделение);
	Запрос.УстановитьПараметр("Период", КонецДня(ДопСоглашениеСсылка.Дата));
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	УправленческийОстатки.СуммаОстатокКт,
	|	УправленческийОстатки.Субконто1,
	|	УправленческийОстатки.Субконто2,
	|	УправленческийОстатки.Подразделение
	|ИЗ
	|	РегистрБухгалтерии.Управленческий.Остатки(
	|			&Период,
	|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Управленческий.ВзаиморасчетыСПокупателями),
	|			,
	|			Подразделение = &Подразделение
	|				И Субконто1 = &Контрагент
	|				И Субконто2 = &ДопСоглашение) КАК УправленческийОстатки";
	
	Результат = Запрос.Выполнить();
	
	Если НЕ Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		Ответ = Выборка.СуммаОстатокКт;
	КонецЕсли;
	
	Возврат Ответ;
	
КонецФункции
